// console.log("Plant vs Animals")
// var gameName = "Plants vs Animals"
// var name = prompt("What is your name?")
// alert("Your game crashed: " + name)
// if (confirm("Are you leaving?")) {
//     alert("See you next time!")
// } else {
//     alert("YAY you are not leaving!")
// }

// Приветсвуем дерево с лианами
// Как тебя зовут?
// Ты птичка?
//     Да Хорошего полёта Имя
//     Нет Имя я тебя сейчас поймаю 
//
// Привет червяк
// Ты нашёл клад в пещере?
//     Да Ура пошли выкапывать
//     Нет Эх придётся мне искать
//
// Привет моя армия муравьёв
// Вы остановили врага?
//     Да Хорошо продолжайте в том же духе
//     Нет Пришлю вам помощи
//
// Приветствуем Марк
// Ну что, здаёшся?
//     Да Я победитель
//     Низачто Продолжать атаку!
//
// Приветствует дерево с лианами
// Белка ты меня будеш грысть сечас
//     Да Я тебе за хвост схвачу
//     Нет Я всё равно защищаю друзей